app/controllers/devices_controller.rb

SELECT * FROM "devices"
---
  def index
    @devices = Device.all

SELECT * FROM "devices" WHERE ("devices"."id" = 1)
SELECT * FROM "reports" WHERE ("reports"."device_id" = '6') ORDER BY reports.id DESC LIMIT 1
SELECT * FROM "report_fields" WHERE ("report_fields"."report_id" = 6)
SELECT * FROM "reports" WHERE ("reports"."device_id" = '6') LIMIT 1
SELECT * FROM "report_fields" WHERE ("report_fields"."report_id" = 13 AND "report_fields"."key" = 'latitude') LIMIT 1
---
  def show

    @device = Device.find(params[:id])
    @report_id = Report.last(:conditions => {:device_id => @device.id})
    @report = ReportField.all(:conditions => {:report_id => @report_id.id})
    @report = @report.sort_by { |t| t.key }
    @lat =    ReportField.find(:first, :conditions => {:report_id => @report_id.id, :key => 'latitude'})

INSERT INTO "devices" ("device_code", "created_at", "updated_at") VALUES('AAC73', '2010-02-06 19:47:09', '2010-02-06 19:47:09')
---
  def create
    @device = Device.new(params[:device])

    respond_to do |format|
      if @device.save

SELECT * FROM "devices" WHERE ("devices"."id" = 2)
DELETE FROM "devices" WHERE "id" = 2
---
  def destroy
    @device = Device.find(params[:id])
    @device.destroy