app/controllers/reports_controller.rb

SELECT * FROM "reports"
---
  def index
    @reports = Report.all

SELECT * FROM "reports" WHERE ("reports"."id" = 1)
---
  def show
    @report = Report.find(params[:id])

SELECT * FROM "reports" WHERE ("reports"."id" = 7)
---
  def edit
    @report = Report.find(params[:id])

INSERT INTO "devices" ("device_code", "created_at", "updated_at") VALUES(NULL, '2010-02-06 21:33:31', '2010-02-06 21:33:31')
INSERT INTO "reports" ("created_at", "updated_at", "device_id") VALUES('2010-02-06 21:33:31', '2010-02-06 21:33:31', 2)
SELECT * FROM "devices" WHERE ("devices"."device_code" = 'AAC73') LIMIT 1
---
  def create
    @device_code = params[:report].delete(:device_code)
    @device = Device.find_or_create_by_code :device_code => @device_code