app/controllers/reports_controller.rb

  def show
    @report = if params[:device_id] && params[:id] == 'last'
      Device.find(params[:device_id]).reports.last
    else
      Report.find params[:id]
---
SELECT * FROM "reports"